; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-73)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 - object)
 (:init 
    (arm-empty)
    (clear b4)
    (on b4 b17)
    (on b17 b7)
    (on b7 b3)
    (on b3 b10)
    (on b10 b19)
    (on b19 b1)
    (on b1 b22)
    (on b22 b8)
    (on b8 b11)
    (on b11 b16)
    (on b16 b20)
    (on b20 b2)
    (on b2 b18)
    (on b18 b9)
    (on b9 b14)
    (on b14 b12)
    (on-table b12)
    (clear b13)
    (on b13 b6)
    (on b6 b21)
    (on b21 b15)
    (on b15 b5)
    (on-table b5))
 (:goal (and 
(clear b13) (on b13 b15)
))
)

; plan
1. (unstack b13 b6)
   deleted: (on b13 b6) (clear b13) (arm-empty)
   added: (holding b13) (clear b6)
   goals met: 0 of 2
2. (stack b13 b4)
   deleted: (clear b4) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b4)
   goals met: 1 of 2
3. (unstack b6 b21)
   deleted: (on b6 b21) (clear b6) (arm-empty)
   added: (holding b6) (clear b21)
   goals met: 1 of 2
4. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 1 of 2
5. (unstack b21 b15)
   deleted: (on b21 b15) (clear b21) (arm-empty)
   added: (holding b21) (clear b15)
   goals met: 1 of 2
6. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 1 of 2
7. (unstack b13 b4)
   deleted: (on b13 b4) (clear b13) (arm-empty)
   added: (holding b13) (clear b4)
   goals met: 0 of 2
8. (stack b13 b15)
   deleted: (clear b15) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b15)
   goals met: 2 of 2
